""" Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума) """

import random


def inputArray():
    n = int(input('Введите количество элементов массива: '))
    list_1 = [(random.randint(1, 100)) for i in range(n)]
    return list_1


def input_interval(min, max):

    return

list_1 = inputArray()
print(list_1)